#### Terraform Plan
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_budget_alert_rule.any_spend will be created
  + resource "oci_budget_alert_rule" "any_spend" {
      + budget_id      = "ocid1.budget.oc1..aaaaaaaadcfqslnohqj5cnqjtcmyi5qgsryvdeu6anh7tycucvrf4siq5yra"
      + defined_tags   = {
          + "terraform.managed" = "terraform"
          + "terraform.repo"    = "https://github.com/batinicaz/oci-core"
        }
      + description    = "Alert as soon as any spending is detected"
      + display_name   = "any-spend-detected"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + message        = "INFO: Spending has been detected on your £5 budget"
      + recipients     = (sensitive value)
      + state          = (known after apply)
      + threshold      = 1
      + threshold_type = "PERCENTAGE"
      + time_created   = (known after apply)
      + time_updated   = (known after apply)
      + type           = "ACTUAL"
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```